
def to_unicode(text: str)->str:
    """
    :param text:
    :return:
    """
    # ordering by length (ie '(/A' before '/A' and before 'A'
    # should do the trick
    # better, use ordered dict
    ordered_voc =
    # upper greek letter are rendered with *
    # and spiritus gravis stands before, not after the letter
    for key, item in ordered_voc.items():
        text = text.replace(item, key)
    return text

def to_betacode(text: str)->str:
    """
    :param text:
    :return:
    """
    for key, item in voc.items():
        text = text.replace(key, item)
    return text

voc = {

    "α": "a",
    "ᾳ": "a|",

    "ἁ": "a(",
    "ἀ": "a)",
    "ᾀ": "a)|",
    "ᾁ": "a(|",

    "ὰ": "a\\",
    "ᾲ": "a\|",
    "ά": "a/",
    "ᾴ": "a/|",
    "ᾶ": "a=",
    "ᾷ": "a=|",

    "ἅ": "a(//",
    "ᾅ": "a(/|",

    "ἂ": "a)\\",
    "ᾄ": "a)/|",

    "ἆ": "a)=",
    "ἇ": "a(=",

    "ᾇ": "a(=|",
    "ᾆ": "a)=|",

    "β": "b",
    "γ": "g",
    "δ": "d",

    "ε": "e",
    "ἑ": "e(",
    "ἐ": "e)",

    "ὲ": "e\\",
    "έ": "e//",

    "ἒ": "e)\\",
    "ἓ": "e(\\",
    "ἔ": "e)/",
    "ἕ": "e(/",

    "ζ": "z",

    "η": "h",
    "ῃ": "h|",

    "ἡ": "h(",
    "ἠ": "h)",
    "ὴ": "h\\",
    "ή": "h/",
    "ῆ": "h=",
    "ῇ": "h=|",

    "ἤ": "h)/",
    "ἥ": "h(/",

    "ἢ": "h)\\",
    "ἣ": "h(\\",

    "ᾓ":"h(\|",
    "ᾒ":"h)\|",

    "ᾗ":"h(=|",
    "ᾖ":"h)=|",

    "ᾕ":"h(/|",
    "ᾔ":"h)/|",

    "ἦ": "h)=",
    "ἧ": "h(=",

    "ῂ": "h)|",
    "ᾑ": "h(|",


    "θ": "q",

    "ι": "i",
    "ἰ": "i)",
    "ἱ": "i(",

    "ὶ": "i\\",
    "ί": "i/",
    "ῖ": "i=",

    "ἲ": "i)\\",
    "ἴ": "i)/",
    "ἳ": "i(\\",
    "ἵ": "i(/",
    "ἶ": "i)=",
    "ἷ": "i(=",
    "ϊ": "i+",
    "ΐ": "i+/",
    "ῒ": "i+\\",

    "κ": "k",
    "λ": "l",
    "μ": "m",
    "ν": "n",
    "ξ": "",

    "ο": "o",

    "ὀ": "o)",
    "ὁ": "o(",

    "ὸ": "o\\",
    "ό": "o/",

    "ὄ": "o)/",
    "ὅ": "o(/",
    "ὃ": "o(\\",
    "ὂ": "o)\\",

    "π": "p",

    "ῥ": "r(",
    "ρ": "r",

    "σ": "s",
    "ς": "s",
    "τ": "t",

    "υ": "u",
    "ὑ": "u(",
    "ὐ": "u)",
    "ὺ": "u\\",
    "ύ": "u/",
    "ῦ": "u=",

    "ὒ": "u)\\",
    "ὔ": "u)/",
    "ὕ": "u(/",
    "ὓ": "u(\\",
    "ὖ": "u)=",
    "ὗ": "u(=",

    "ϋ": "u+",
    "ῢ": "u+\\",
    "ῧ": "u+=",
    "ΰ": "u+/",

    "χ": "x",
    "ψ": "y",
    "φ": "f",

    "ω": "w",

    "ὡ": "w(",
    "ὠ": "w)",
    "ῳ": "w",

    "ὼ": "w\\",
    "ώ": "w/",
    "ῶ": "w=",
    "ῷ": "w=|",
    "ῲ": "w\|",

    "ὢ": "w)\\",
    "ὤ": "w)/",
    "ὥ": "w(/",
    "ὣ": "w(\\",
    "ᾥ": "w(/|",
    "ᾤ": "w)\|",

    "ᾣ": "w(\|",

    "ᾢ": "w)\|",

    "ὦ": "w)=",
    "ὧ": "w(=",

    "ᾦ" :"w)=|",

    "ᾧ": "w(=|",
    }

